Show / Hide Table of Contents
Class OpenElementId
Open element base class POS - class can not be abstract -it causes problems with serialization
Inheritance
System.Object
OpenObject
OpenElementId
ConcreteSetup
CheckSection
BeamData
ConnectedMember
ConnectionPoint
PlateData
CrossSection
ReinforcedCrossSection
DappedEnd
ISDModel
LineSupport
CalculationCase
Opening
PatchDevice
Reinforcement
Point3D
PointOnLine3D
PolyLine3D
Region3D
Segment3D
CombiInput
LoadCase
LoadGroup
LoadInPoint
LoadOnLine
LoadOnSurface
PointLoadOnLine
ResultClass
SelectionItemForResults
Settlement
StrainLoadOnLine
TemperatureLoadOnLine
BoltAssembly
Material
DesignMember
Element1D
Element2D
HingeElement1D
CheckMember
InitialImperfectionOfPoint
LineSupportSegment
Member1D
Member2D
PointSupportNode
RebarBase
RebarPatternBase
RebarShape
RigidLink
SubStructure
Tendon
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
[DataContract]
public class OpenElementId : OpenObject
Properties
Improve this Doc   View Source
Id
Element Id
Declaration
[DataMember]
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
 Improve this Doc
 View Source